In [1]:
import pandas as pd

In [7]:
df = pd.read_csv("../fixtures/cluster_title_normalized_dups_size_keylen.tsv", sep="\t", names=["size", "len"])

In [8]:
len(df)

5818143

In [9]:
df.head()

   size  len
0   264    0
1     2    3
2     2    3
3     2    3
4     2    4

In [21]:
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [23]:
print(df.describe())

             size         len
count 5818143.000 5818143.000
mean        4.350      52.120
std       196.347      35.026
min         2.000       0.000
25%         2.000      24.000
50%         2.000      46.000
75%         3.000      72.000
max    151383.000   11686.000

In [27]:
df[df["size"] > 4]

         size  len
0         264    0
187         5    1
276        28   11
284         7    6
288         6    6
...       ...  ...
5818054     7    2
5818060     6    4
5818104     6    2
5818118     5    4
5818128    13    4

[448170 rows x 2 columns]

In [28]:
df[df["size"] >= 10]

         size  len
0         264    0
276        28   11
314       195   15
329        10   14
364        98   15
...       ...  ...
5817734    18    5
5817835    11    4
5817886    20    5
5817901    15   10
5818128    13    4

[159500 rows x 2 columns]

In [30]:
df[df["size"] > 100]

         size  len
0         264    0
314       195   15
428       122   31
525       173   28
727       270   31
...       ...  ...
5816100   147    4
5817345   167    2
5817361   258    2
5817366   298    2
5817374   252    2

[9610 rows x 2 columns]

In [31]:
len(df)

5818143